io-test/experiment/results/100/ab.out
This is ApacheBench, Version 2.3 <$Revision: 1604373 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking cpu-test-dora.diego-1.cf-app.com (be patient)


Server Software:        
Server Hostname:        cpu-test-dora.diego-1.cf-app.com
Server Port:            80

Document Path:          /
Document Length:        84 bytes

Concurrency Level:      100
Time taken for tests:   15.556 seconds
Complete requests:      10000
Failed requests:        0
Non-2xx responses:      10000
Total transferred:      3140000 bytes
HTML transferred:       840000 bytes
Requests per second:    642.85 [#/sec] (mean)
Time per request:       155.556 [ms] (mean)
Time per request:       1.556 [ms] (mean, across all concurrent requests)
Transfer rate:          197.13 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       72   76  95.8     73    5055
Processing:    73   75   1.9     75      96
Waiting:       73   75   1.9     75      96
Total:        145  151  95.8    148    5128

Percentage of the requests served within a certain time (ms)
  50%    148
  66%    149
  75%    150
  80%    150
  90%    150
  95%    151
  98%    155
  99%    159
 100%   5128 (longest request)